// Informatization_1_5.cpp : Defines the entry point for the console application.
//Mошкин Никита ПС-22.
//1.5. Информатизация садоводства (8)
//Дачный участок Степана Петровича имеет форму прямоугольника размером a  b.На участке
//имеется n построек, причем основание каждой постройки — прямоугольник со сторонами,
//параллельными сторонам участка.
//Вдохновленный успехами соседей, Степан Петрович хочет посадить на своем участке m видов
//плодовых культур(участок Степана Петровича находится в северной местности, поэтому m = 1
//или m = 2).Для каждого вида растений Степан Петрович хочет выделить отдельную
//прямоугольную грядку со сторонами, параллельными сторонам участка.Само собой, грядки не
//могут занимать территорию, занятую постройками или другими грядками.
//Степан Петрович хочет расположить грядки таким образом, чтобы их суммарная площадь была
//максимальной.Грядки не должны пересекаться, но могут касаться друг друга.
//Требуется написать программу, которая по заданным размерам участка и координатам
//построек определяет оптимальное расположение планируемых грядок.

#include "stdafx.h"


int main()
{
    return 0;
}

